let total = 100,
  ordered = 50;
console.log(
  total >= ordered
    ? "Заказ оформлен, с вами свяжется менеджер"
    : "На складе недостаточно товаров!"
);
ordered = 20;
console.log(
  total >= ordered
    ? "Заказ оформлен, с вами свяжется менеджер"
    : "На складе недостаточно товаров!"
);
ordered = 80;
console.log(
  total >= ordered
    ? "Заказ оформлен, с вами свяжется менеджер"
    : "На складе недостаточно товаров!"
);
ordered = 130;
console.log(
  total >= ordered
    ? "Заказ оформлен, с вами свяжется менеджер"
    : "На складе недостаточно товаров!"
);
